let arr = [];

arr.push(3,4,5,2,34); // додати у кінець
console.log(arr);

arr.pop(); //видалити з кінця 
console.log(arr);
let popE = arr.pop(); // повертає видалене значення
console.log(popE);

arr.unshift('new', 'newnew'); //додавання у початок (бо він змішує усі значення?)
console.log(arr);
arr.shift(); //видалення з початоку (бо він повертає усі значення до норми?)
console.log(arr);

//!!!
arr = [1,2,3,4,5,6,7,8,9,10];
arr.splice(2); //arr = [1,2;
// обрізання усього масиву від 2ого id (невключаючи 2)
arr.splice(-3); //arr = [1,2,3,4,5,6,7
// обрізання останніх трьох елементів
arr.splice(-3,2); // arr = [1,2,3,4,5,6,7,10]
// обрізання з -3 двух елементів
arr.splice(3,4,'hello', 'world'); //arr = [1,2,3, 'hello', 'world', 10]
// вирізає 4 елемента, починаючи з третього, після чого закидує усі значення починаючи з третього переданого параметру



arr = [1,2,3,4,5,6,7,8,9,10];
let slice1 = arr.slice(); // вбере весь масив
console.log(slice1);
let slice2 = arr.slice(2); // вбере весь масив починаючи з 2ого індексу 
console.log(slice2);
let slice3 = arr.slice(-3); // вбере весь масив починаючи з 2ого рахуючи з кінця масиву
console.log(slice3);
let slice4 =arr.slice(2, 4); // вбере кусок масиву з 2 (включно) до 4 (невключаючи 4)
console.log(slice4);

// !!! splice && slice при вирізанні (або копіюванні) копіюють об'єкти що були вирізані, тож вони мають однакове посилання на комірку