-- Structured Query Language (SQL) - мова програмування для взаємодії з базами данних
-- по стандарту SQL переводить увесь текст у нижній регістр, тож написи типу SELECT саме для вираження ключових слів 
/*
  ключові  сліва = CREATE,TABLE,SELECT
  індитифікатор/назва = "VIP_users", users
 */
--
--
--
-- =============== КОНСТАНТИ =================
--
'name' -- рядкова константа (не плутати з "name"(назва))
'iм''я' -- '' === екранований апостроф
$$i м 'я$$ -- екранування саме для Postgres' --
/*
  SELECT 'foo'
  'bar';
  эквивалентно:
  SELECT 'foobar';
  но эта запись:
  SELECT 'foo' 'bar';
  считается синтаксической ошибкой.
 */
--
-- усі варіанти чисел = 42  3.5 4.  .001   5e2  1.925e-3
CREATE TABLE users();
CREATE TABLE "VIP_users"();
DROP TABLE "VIP_users";