  /*https://uk.legacy.reactjs.org/docs/hooks-rules.html

  
1
  Не викликайте хуки зі звичайних JavaScript-функцій. Натомість, ви можете:
  Викликати хуки з функціонального компоненту React.
  Викликати хуки з користувацьких хуків (ми навчимося це робити на наступній сторінці).

2
  Не використовуйте хуки усередині циклів, умовних операторів або вкладених функцій.
  
  Натомість, завжди використовуйте хуки на найвищому рівні React-функцій.
  // НЕПРАВИЛЬНО
  // if(5 > 10) {
  //   useEffect(() => {
  //     console.log('some stuff')
  //   });
  // }
  */
  // ПРАВИЛЬНО
  useEffect(()=> {
    if(5 > 10) {
      console.log('some stuff');
    }
  });